HarleyCoops/workspaceAlbertaSetup/firmware/companion/sdkconfig.defaults
# WorkspaceAlberta Handheld Companion — experiment defaults
# Target: Waveshare ESP32-S3-Touch-AMOLED-1.8 V2
# 16MB flash, 8MB OPI PSRAM. Values aligned with Waveshare
# examples/esp-idf/00_bsp_quickstart/sdkconfig.defaults.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_FREERTOS_HZ=1000

# Octal PSRAM (ESP32-S3R8, 8MB OPI)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# USB-C on this board is the ESP32-S3 native USB port (Waveshare docs).
# Serial config + idf.py monitor typically appear as /dev/ttyACM0.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# LVGL fonts used by the experiment UI (same set as Waveshare BSP quickstart)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# WiFi buffers from the original scaffold
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64

# Experiment placeholders only — never put real passwords here.
CONFIG_WA_WIFI_SSID=""
CONFIG_WA_WIFI_PASSWORD=""
CONFIG_WA_BRIDGE_HOST="192.168.1.100"
CONFIG_WA_BRIDGE_PORT=8788
CONFIG_WA_SOFTAP_SSID="WA-Companion"
CONFIG_WA_HEALTH_INTERVAL_MS=5000
